In [2]:
import pandas as pd
pd.set_option('display.max_rows', 15)
df = pd.read_csv('student_admission_record_dirty.csv') 
df

,Name,Age,Gender,Admission Test Score,High School Percentage,City,Admission Status
0,Shehroz,24.0,Female,50.0,68.90,Quetta,Rejected
1,Waqar,21.0,Female,99.0,60.73,Karachi,NaN
2,Bushra,17.0,Male,89.0,NaN,Islamabad,Accepted
3,Aliya,17.0,Male,55.0,85.29,Karachi,Rejected
4,Bilal,20.0,Male,65.0,61.13,Lahore,NaN
...,...,...,...,...,...,...,...
152,Ali,19.0,Female,85.0,78.09,Quetta,Accepted
153,Bilal,17.0,Female,81.0,84.40,Islamabad,Rejected
154,Fatima,21.0,Female,98.0,50.86,Multan,Accepted
155,Shoaib,-1.0,Male,91.0,80.12,Quetta,Accepted
156,Maaz,17.0,Male,88.0,86.85,Lahore,Accepted

In [3]:
df.describe()

              Age  Admission Test Score  High School Percentage
count  147.000000            146.000000              146.000000
mean    19.680272             77.657534               75.684726
std      4.540512             16.855343               17.368014
min     -1.000000             -5.000000              -10.000000
25%     18.000000             68.250000               65.052500
50%     20.000000             79.000000               77.545000
75%     22.000000             89.000000               88.312500
max     24.000000            150.000000              110.500000

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 157 entries, 0 to 156
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    147 non-null    object
 1   Age                     147 non-null    float64
 2   Gender                  147 non-null    object
 3   Admission Test Score    146 non-null    float64
 4   High School Percentage  146 non-null    float64
 5   City                    147 non-null    object
 6   Admission Status        147 non-null    object
dtypes: float64(3), object(4)
memory usage: 8.7+ KB

In [5]:
df.isnull().sum() #결측치 확인방법

Name                      10
Age                       10
Gender                    10
Admission Test Score      11
High School Percentage    11
City                      10
Admission Status          10
dtype: int64

In [6]:
df[df['Age'].isnull()] #Name Column에서 결측치 있는 값들 다 찾아보기
df['Age'] = df['Age'].fillna(df['Age'].mean()) #Age결측치의 값들을 모두 Age의 평균값으로 대체하기

In [7]:
print(df.columns)

Index(['Name', 'Age', 'Gender', 'Admission Test Score',
       'High School Percentage', 'City', 'Admission Status'],
      dtype='object')

In [8]:
df[df['Name'].isnull()]
df['Name'] = df['Name'].ffill() #이름의 결측치 값들을 모두 이전 값들로 대체하기
df

,Name,Age,Gender,Admission Test Score,High School Percentage,City,Admission Status
0,Shehroz,24.0,Female,50.0,68.90,Quetta,Rejected
1,Waqar,21.0,Female,99.0,60.73,Karachi,NaN
2,Bushra,17.0,Male,89.0,NaN,Islamabad,Accepted
3,Aliya,17.0,Male,55.0,85.29,Karachi,Rejected
4,Bilal,20.0,Male,65.0,61.13,Lahore,NaN
...,...,...,...,...,...,...,...
152,Ali,19.0,Female,85.0,78.09,Quetta,Accepted
153,Bilal,17.0,Female,81.0,84.40,Islamabad,Rejected
154,Fatima,21.0,Female,98.0,50.86,Multan,Accepted
155,Shoaib,-1.0,Male,91.0,80.12,Quetta,Accepted
156,Maaz,17.0,Male,88.0,86.85,Lahore,Accepted

In [9]:
df[df['Gender'].isnull()]
df['Gender'] = df['Gender'].bfill() #Gender 결측치 값들 이후 데이터 값들로 대체하기
df

,Name,Age,Gender,Admission Test Score,High School Percentage,City,Admission Status
0,Shehroz,24.0,Female,50.0,68.90,Quetta,Rejected
1,Waqar,21.0,Female,99.0,60.73,Karachi,NaN
2,Bushra,17.0,Male,89.0,NaN,Islamabad,Accepted
3,Aliya,17.0,Male,55.0,85.29,Karachi,Rejected
4,Bilal,20.0,Male,65.0,61.13,Lahore,NaN
...,...,...,...,...,...,...,...
152,Ali,19.0,Female,85.0,78.09,Quetta,Accepted
153,Bilal,17.0,Female,81.0,84.40,Islamabad,Rejected
154,Fatima,21.0,Female,98.0,50.86,Multan,Accepted
155,Shoaib,-1.0,Male,91.0,80.12,Quetta,Accepted
156,Maaz,17.0,Male,88.0,86.85,Lahore,Accepted

In [10]:
df[df['Admission Test Score'].isnull()]
df['Admission Test Score'] = df['Admission Test Score'].fillna(df['Admission Test Score'].median()) #Admission Test Score 값들의 중앙값으로 대체하기
df

,Name,Age,Gender,Admission Test Score,High School Percentage,City,Admission Status
0,Shehroz,24.0,Female,50.0,68.90,Quetta,Rejected
1,Waqar,21.0,Female,99.0,60.73,Karachi,NaN
2,Bushra,17.0,Male,89.0,NaN,Islamabad,Accepted
3,Aliya,17.0,Male,55.0,85.29,Karachi,Rejected
4,Bilal,20.0,Male,65.0,61.13,Lahore,NaN
...,...,...,...,...,...,...,...
152,Ali,19.0,Female,85.0,78.09,Quetta,Accepted
153,Bilal,17.0,Female,81.0,84.40,Islamabad,Rejected
154,Fatima,21.0,Female,98.0,50.86,Multan,Accepted
155,Shoaib,-1.0,Male,91.0,80.12,Quetta,Accepted
156,Maaz,17.0,Male,88.0,86.85,Lahore,Accepted

In [11]:
df.isnull().sum()

Name                       0
Age                        0
Gender                     0
Admission Test Score       0
High School Percentage    11
City                      10
Admission Status          10
dtype: int64

In [12]:
df[df['High School Percentage'].isnull()]
df['High School Percentage'] = df['High School Percentage'].fillna(df['High School Percentage'].median()) #High School Percentage 값들의 중앙값으로 대체하기
print(df)

        Name   Age  Gender  Admission Test Score  High School Percentage  \
0    Shehroz  24.0  Female                  50.0                  68.900
1      Waqar  21.0  Female                  99.0                  60.730
2     Bushra  17.0    Male                  89.0                  77.545
3      Aliya  17.0    Male                  55.0                  85.290
4      Bilal  20.0    Male                  65.0                  61.130
..       ...   ...     ...                   ...                     ...
152      Ali  19.0  Female                  85.0                  78.090
153    Bilal  17.0  Female                  81.0                  84.400
154   Fatima  21.0  Female                  98.0                  50.860
155   Shoaib  -1.0    Male                  91.0                  80.120
156     Maaz  17.0    Male                  88.0                  86.850

          City Admission Status
0       Quetta         Rejected
1      Karachi              NaN
2    Islamabad         Accepted
3      Karachi         Rejected
4       Lahore              NaN
..         ...              ...
152     Quetta         Accepted
153  Islamabad         Rejected
154     Multan         Accepted
155     Quetta         Accepted
156     Lahore         Accepted

[157 rows x 7 columns]

In [13]:
df.isnull().sum()
df['City'].mode()[0] #City에서 가장 많이 나온 도시는 "Quetta"임
df['City'] = df['City'].fillna(df['City'].mode()[0]) #City에서 가장 많이 나온 도시인 "Quetta"를 최빈값으로 하여 해당 값을 결측치로 대처함

In [14]:
df.isnull().sum()
df[df['Admission Status'].isnull()]
df['Admission Status'] = df['Admission Status'].ffill() #Admission Status를 이전 값으로 대처하기 그 이유는 결측치들을 보았을 때
#해당 값이 66, 67로 연속적인 결측치가 존재하였지만 65번째 값으로 결측치를 대채하기

In [16]:
df.isnull().sum()

Name                      0
Age                       0
Gender                    0
Admission Test Score      0
High School Percentage    0
City                      0
Admission Status          0
dtype: int64